### [판다스 강의1] 판다스, 데이터프레임, 시리즈 알아보기

In [1]:
# 파이썬에서 판다스 라이브러리를 사용하기 위해 라이브러리를 불러오고
# 판다스 라이브러리를 pd라는 축약된 이름으로 사용하겠다. 라고 선언한다.
import pandas as pd # tap키 -> 자동완성

In [2]:
# read_csv()를 호출하여 인자로 전달하는 csv파일을 불러오는데 dataframe을 
# 만들어서 불러온다.
data_frame = pd.read_csv('data/drinks.csv')

In [3]:
# 불러온 data_frame을 출력한다.
# excel파일 형식으로 데이터를 불러온다.
# 수학적으로 데이터를 변경하거나 계산을 할 때, excel보다 판다스 라이브러리를
# 활용하면 더 빠르기 처리할 수 있기 때문에 사용한다.
data_frame # 입력하고 shift+enter를 누르면 밑에 csv파일을 보여준다.

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [8]:
# head()는 전체 데이터 중 첫 두줄(2개)의 데이터만 얻어 새로운 데이터프레임을 생성하여 출력하자
data_frame.head(2) # 입력하고 shift+enter를 누르면 밑에 csv파일을 보여준다.

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU

In [9]:
# tail()는 전체 데이터 중에 마지막에 존재하는 두 즐의 데이터만 얻어서 출력한다.
data_frame.tail(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### 출력결과 중 세로 컬럼줄을 시리즈(Series)라고 부른다.
### (#의 갯수만큼 글자크기가 작아진다)
### DataFrame이란 시리즈들로 구성된 전체를 말한다.

In [10]:
#

In [11]:
# type(변수) -> 변수에 저장된 데이터의 종류, 유형(type)이 출력된다.
type(data_frame.country) # 출력값 pandas.core.series.Series

pandas.core.series.Series

### 출력결과 : country 세로 열은 시리즈(Series)라는 것을 알 수 있다.

In [12]:
# 리스트 만들어보기
list_temp = [1,2,3]

In [16]:
# 리스트 출력
list_temp # 출력값 [1, 2, 3]

[1, 2, 3]

In [17]:
#

In [18]:
# 시리즈(Series)를 만드는 방법
# - 리스트를 이용하여 시리즈를 만들 수 있다.
# - 파이썬의 []리스트로 만든다.

# 시리즈 만들기
s1 = pd.core.series.Series([1,2,3]) # pandas모듈.core패키지명.series.series생성자()
s2 = pd.core.series.Series(['one', 'two', 'three'])

In [23]:
# 위에서 생성한 시리즈를 이용하여 데이터프레임(표)를 만들어보자.
pd.DataFrame(data = dict(num = s1, word = s2) ) # DataFrame()객체를 이용하여 만들 수 있다.

   num   word
0    1    one
1    2    two
2    3  three

############################################################################

## [ 판다스 강의 2. ] 파일에서 데이터 불러오기

In [24]:
# .csv파일에서 데이터 불러오기
df = pd.read_csv('data/friend_list.csv')

In [28]:
# DataFrame 이용하여 출력하기
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [32]:
# 처음 행의 데이터부터 5개의 행 데이터만 보여주는 head() 호출 하기
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [31]:
# 뒤에서부터 5개 행의 데이터만 보고 싶을 때 tail() 호출 하기
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [33]:
# 처음부터 2개의 행만 보고싶을 때 head(행의 갯수) 호출 하기
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [34]:
# 뒤에서 3개의 행만 보고싶을 때 tail(행의 갯수) 호출 하기
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

#########

### 판다스 라이브러리로 .csv파일의 데이터만 불러올 수 있는가?
### -> 아니다. ','로 구분된 .txt파일의 데이터도 불러올 수 있다.

### data 폴더의 friend_list.txt파일을 열어서 데이터들이 ','로 구분되어 있는지 확인해보자.

In [36]:
# friend_list.txt파일의 데이터 불러오기
df = pd.read_csv('data/friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

### .csv파일이나 .txt파일에 ','로 구분되어있지만 tab으로 컬럼줄이 구분되어있다면
### 데이터를 제대로 불러올 수 있는가?
### -> 불러올 수 있다.

### data/friend_list_tab.txt파일을 열어 컬럼줄이 tab공백으로 구분되어있는지 확인해보자
### 단, delimiter = 't' 구분자는 tab으로 구분되어있다고 판다스 라이브러리에 알려주어야한다.

In [39]:
# friend_list_tab.txt 파일의 데이터 불러오기
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t') # read_csv('경로', 구분자)
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

#############################################

### 이 때까지, 항상 컬럼의 제목줄(header)이 존재했지만 데이터 줄만 존재할 때, 데이터를 불러올까?

#### -> 데이터를 불러올 때 판다스 라이브러리에 제목줄(header)이 없다고 알려주면 데이터를 불러와야 한다.
#### -> 만약, 파일에 데이터 헤더가 없을 경우, header = None으로 지정하여 첫번째 데이터가 데이터 헤더로 들어가는 것을 방지해줘야한다.

In [60]:
df = pd.read_csv('data/friend_list_no_head.csv')
df # 헤더부분의 출력 오류

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [48]:
df = pd.read_csv("data/friend_list_no_head.csv", header = None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

#############################################

### 위와 같이 헤더가 없는 데이터를 데이터 프레임을 호출했을 때,
### 아래와 같이 데이터프레임 생성 후에 컬럼 헤더를 지정해 줄 수 있다.

In [53]:
# columns을 이용하여 판다스 라이브러리 제목 줄에 컬럼명을 부여할 수 있다.
# df.columns

In [55]:
# 위 데이터프레임을 생성하는 일과 그 후에 컬럼 헤더를 따로 지정하는 일을 한번에 해보자.
# - 데이터 줄만 존재할 때, 판다스 라이브러리에서 헤더가 없다고 알려주며
#   제목줄에 컬럼명을 부여하면서 파일의 데이터를 불러올 수 있다.
#   또한, 파일을 데이터프레임으로 호출하는 동시에
#   헤더를 아래와 같이 지정할 수도 있다.
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

#############################################

### [ 판다스 강의 3. ] 데이터프레임 생성하기

In [2]:
import pandas as pd

#### 데이터프레임을 파이썬 코드로 생성하기

#### 딕셔너리로 데이터프레임 생성하기

#### - 파이썬의 기본 자료구조로 데이터프레임 생성이 가능하다.
#### - 딕셔너리로 데이터프레임을 생성하자.

In [67]:
friend_dict_list = [{'name':'Jone', 'age':20, 'job':'Student'}, 
                    {'name':'Jenny', 'age':30, 'job':'Developer'},
                    {'name':'Nate', 'age':30, 'job':'Teacher'}
                   ] # 딕셔너리 자료형

# 위 리스트에 저장되어있는 딕셔너리를 활용해서 데이터프레임 생성
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

#############################################

#### - 데이터 프레임 생성 시, 컬럼의 순서가 뒤바뀔 수 있다.
#### - 아래와 같이 컬럼을 원하는 순서로 지정할 수 있다.

In [68]:
df = df[['age','name','job']]
df

   age   name        job
0   20   Jone    Student
1   30  Jenny  Developer
2   30   Nate    Teacher

#############################################

### 파이썬의 List로 데이터프레임 생성하기
#### - 리스트로 데이터프레임을 생성하는 예제

In [70]:
# 행단위의 요소들을 리스트에 저장한다.
friend_list = [ ['John', 20, 'Student'],
                ['Jenny', 30, 'Developer'],
                ['Nate', 30, 'Teacher']
              ]

# 컬럼 헤더 정보를 담는 변수
column_name = ['name', 'age', 'job']

# 새로운 데이터프레임을 생성한다.
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

#############################################

### 컬럼 헤더와 행 단위의 요소들을 리스트로 따로 만들지 않고 한번에 프레임 만들기

In [145]:
# collections 라이브러리 내부의 OrderedDict객체 사용을 위해 불러온다
from collections import OrderedDict

friend_list = [
               ['name', ['John', 'Jenny', 'Nate' ] ],
               ['age', [20, 30, 30] ],
               ['Job', ['Student', 'Developer', 'Teacher'] ]
]

df = pd.DataFrame.from_dict( OrderedDict(friend_list) )
df # 0 1 2 행은 Series라고 부른다.

    name  age        Job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

#############################################

### [ 판다스 강의 4. ] 데이터프레임 파일로 저장하기

#### - 파일로 데이터프레임 저장하기

In [5]:
# 리스트 데이터 내부에 딕셔너리를 사용해서 데이터프레임을 만들기 위해 
# friends 리스트를 생성한다.
friends = [ 
            {'age':'John', 'name':20, 'Job':'Student'},
            {'age':'Jenny', 'name':30, 'Job':None}, # None은 Null과 같다
            {'age':'Nate', 'name':30, 'Job':'Teacher'}
          ]

# 컬럼 헤더 정보 순서를 완벽히 설정하지않고 데이터프레임 생성
df = pd.DataFrame(friends)
df

     age  name      Job
0   John    20  Student
1  Jenny    30     None
2   Nate    30  Teacher

In [8]:
# 컬럼 헤더 정보의 순서를 다시 수정하여 새로운 데이터프레임을 만들어보자
df = df[ ['name', 'age', 'Job'] ]
df

   name    age      Job
0    20   John  Student
1    30  Jenny     None
2    30   Nate  Teacher

#### => 데이터프레임객체의 to_csv()를 사용하여 생성한 데이터프레임을 파일로 저장할 수 있다.

In [9]:
df.to_csv('friend_list_from_df.csv') # C:\Users\ITWILL\pandas-master 경로에 파일 생성

### Row의 Index값을 넣지 않는 상테에서 DataFrame을 생성하려면 index속성값을 = False로 작성하면 된다.

In [10]:
df.to_csv('friend_list_from_df_row.csv', index = False, header = True) 
# .to_csv('저장 할 파일명',                index속성값,   header속성값)

#############################################

### None값이 있는 데이터프레임의 예제이다.

In [16]:
from collections import OrderedDict

In [19]:
friend_list = [
                ['name', ['John', None, 'Nate'] ],
                ['age', [20, None, 30] ],
                ['job', ['Student', 'Developer', 'Teacher'] ]
              ]


# 데이터프레임 생성
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

   name   age        job
0  John  20.0    Student
1  None   NaN  Developer
2  Nate  30.0    Teacher

In [20]:
# 바로 위에서 생성한 데이터프레임을 파일로 저장해서 확인해보자
df.to_csv('friend_list_from_df_none.csv') # .to_csv('저장 할 파일명')

### na_rep속성을 사용하면 None값을 원하는 값으로 변경할 수 있다.

In [21]:
df.to_csv('friend_list_from_df_none.csv', na_rep = '-') 
# 동일한 파일명을 사용할 경우에는 이전 파일에 덮어씌운다

In [22]:
# 위 파일을 열어보면 빈 공백 대신 '-'가 들어간 것을 확인할 수 있다.

### [ 판다스 강의 5. ] 데이터프레임에 행과 열을 선택 및 필터

#### - Row 선택하기, Index Row 선택하기

In [41]:
from collections import OrderedDict # 모듈 사용하기

In [42]:
friend_list = [
                ['name', ['John', 'Jenny', 'Nate'] ],
                ['age', [20, 30, 30] ],
                ['job', ['Student', 'Developer', 'Teacher'] ]
              ]

# 데이터프레임 생성
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [43]:
# 행의 index를 사용하여 Row 1부터 3 이전까지인 Index 2 위치까지의 Jenny와 Nate를 순차적으로 선택하여 하나의
# 데이터프레임을 만든 후 df 변수에 저장한다.
df = df[1:3]
df

    name  age        job
1  Jenny   30  Developer
2   Nate   30    Teacher

#############################################

In [49]:
from collections import OrderedDict # 모듈 사용하기

friend_list = [
                ['name', ['John', 'Jenny', 'Nate'] ],
                ['age', [20, 30, 30] ],
                ['job', ['Student', 'Developer', 'Teacher'] ]
              ]

# 데이터프레임 생성
df = pd.DataFrame.from_dict(OrderedDict(friend_list))
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [52]:
# 위의 행의 0 Index 위치의 John줄의 데이터와 2 Index 위치의 Nate줄의 데이터만 선택하여
# 새로운 데이터프레임을 생성해보자
df.loc[[0,2]] # loc()를 이용할 때 인덱스 위치 0과 2를 각각 적어준다.

   name  age      job
0  John   20  Student
2  Nate   30  Teacher

In [55]:
# 바로 위 예제에서 선택한 새로운 데이터프레임은 df변수에 따로 저장하지 않았기 때문에 바로 직전에 생성한
# 데이터프레임을 출력해서 볼 수 있다.

In [54]:
df.head()

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [56]:
# 다음 예제를 위해서 바로 위에 출력되는 데이터프레임을 살펴보자

#### - 컬럼 값에 따른 Row 선택하기

In [58]:
# 마치 데이터베이스에 쿼리를 전달하듯, 특정한 컬럼값을 충족하는 Row만 선택하실 수 있습니다.

# 문제 : 데이터프레임의 age속성이 25이상인 Row들만 선택하여 새로운 데이터프레임을 만들어보자.
df_filtered = df[df.age > 25]

df_filtered

    name  age        job
1  Jenny   30  Developer
2   Nate   30    Teacher

In [59]:
df_filtered = df.query('age>25') # 위 문제와 동일한 문법으로 다른 점은 query()를 사용하였다.
df_filtered

    name  age        job
1  Jenny   30  Developer
2   Nate   30    Teacher

In [60]:
# 다음 예제를 위해서 바로 아래에 출력되는 데이터프레임을 살펴 보자
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [61]:
# 나이가 25살 이상이고, 이름인 Nate인 사람을 선택하여 새로운 데이터프레임을 만들어보자
df_filtered = df[(df.age > 25) & (df.name == 'Nate')]
df_filtered

   name  age      job
2  Nate   30  Teacher

#############################################

### 컬럼 필터하기
#### - Index로 Filter하기

In [71]:
# 리스트 데이터로 데이터 프레임 생성
friend_list = [['John', 20, 'Student'], ['Jenny', 30, 'Developer'], ['Nate', 30, 'Teacher']] # 리스트 생성

df = pd.DataFrame.from_records(friend_list, columns = ['Name', 'Age', 'Job'])
df

    Name  Age        Job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [75]:
# 문제 : 모든 Row를 보여주되, 컬럼 Index 위치를 0부터 1 위치까지만 선택하여 
#        새로운 데이터프레임을 얻어 출력해보자
df.iloc[ : , 0:2]

    Name  Age
0   John   20
1  Jenny   30
2   Nate   30

In [76]:
# 문제 : 모든 Row를 보여주되 컬럼의 위치가 0과 2만 선택해서 새로운 데이터프레임을 생성 후 출력해보자

In [80]:
df.iloc[ : ,  [0, 2]]

    Name        Job
0   John    Student
1  Jenny  Developer
2   Nate    Teacher

### 컬럼명으로 Filter하기

In [83]:
# 열의 헤더 데이터가 없는 데이터프레임을 파일로부터 불러와서 열 헤더를 추가하여 
# 새로운 데이터프레임을 생성하여 만들 수 있다.
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [84]:
# 문제 : 컬럼 헤더명이 name이고, age인 컬럼 줄의 데이터를 선택하고 새로운 데이터프레임을 생성해보자
df_filtered = df[ ['name', 'age'] ]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [85]:
# 다음 예제를 위해서 바로 아래에 출력되는 데이터프레임을 살펴보자
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [86]:
# 문제 : .filter()를 사용하여 컬럼 헤더명이 age, job인 컬럼 줄의 데이터를 선택하여 출력해보자
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [87]:
# 다음 예제를 위해서 바로 아래에 출력되는 데이터프레임을 살펴보자
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [89]:
# 원하는 글자를 가진 Row를 보여준다

# 문제 : 컬럼 헤더명 중에 a문자가 포함되어있는 컬럼의 행의 데이터들만 선택하여 새로운 데이터프레임을 생성해보자
df.filter(like = 'a', axis = 1) # like속성 oracle의 WHERE 컬럼명 like '%a%'와 같다.
                                # axis = 1는 axis속성, 열 축이 하나인것만 선택한다.

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [90]:
# 다음 예제를 위해서 바로 아래에 출력되는 데이터프레임을 살펴보자
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [91]:
# 정규식으로 필터도 가능하다
# 문제 : 컬럼 헤더명 중에 b로 끝나는 컬럼의 행 데이터들만 선택하여 새로운 데이터프레임을 생성해보자

df.filter(regex = 'b$', axis = 1) 

# regex 속성은 정규식 표현을 사용할 수 있는 속성
# / regex속성 = 'b$' b로 끝나는, = 'b^'로 시작하는 /

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

#############################################

### [ 판다스 강의 6. ] 데이터프레임 행(Row), 열(Column) 삭제 하기

#### - row Index로 row를 drop(삭제)할 수 있다.

In [123]:
friend_dict_list = [
                     {'age':20, 'job':'Student'},
                     {'age':30, 'job':'Developer'},
                     {'age':30, 'job':'Teacher'}
                    ]

df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df # 출력을 해보면 인덱스 위치에 이름을 붙여주는 것을 알 수 있다.

       age        job
John    20    Student
Jenny   30  Developer
Nate    30    Teacher

In [124]:
# 문제 : John과 Nate의 행(Row)dml 데이터를 삭제해보자.
df.drop(['John', 'Nate']) # 출력 시 Jenny 행만 남아있는 것을 알 수 있다.

       age        job
Jenny   30  Developer

In [125]:
# 다음 예제를 위해서 바로 아래에 출력되는 데이터프레임을 살펴보자
df # 위 문제에서 데이터를 삭제했지만 삭제한 데이터프레임을 df변수에 저장하지 않았기 때문에 
   # df변수에 데이터프레임은 그대로 남아있는 것을 알 수 있다.

       age        job
John    20    Student
Jenny   30  Developer
Nate    30    Teacher

#### => 삭제(drop)된 결과는 데이터프레임에 저장되지않는다. 저장하고 싶을 때는, 결과를 데이터프레임에 따로 저장해야한다. 

##### 방법 1. John과 Nate행의 정보를 삭제시킨 새로운 데이터프레임을 df변수에 저장하자

In [126]:
# 방법 1.
df = df.drop(['John', 'Nate'])

In [127]:
df

       age        job
Jenny   30  Developer

In [149]:
friend_dict_list = [
                     {'age':20, 'job':'Student'},
                     {'age':30, 'job':'Developer'},
                     {'age':30, 'job':'Teacher'}
                    ]

df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df # 출력을 해보면 인덱스 위치에 이름을 붙여주는 것을 알 수 있다.

       age        job
John    20    Student
Jenny   30  Developer
Nate    30    Teacher

##### 방법 2. drop된 결과를 바로 데이터프레임에 저장하는 방법
###### -> inplace속성을 True라고 적용할 경우, 따로 삭제한 데이터프레임을 저장할 필요없이 drop된 결과가 데이터프레임에 반영된다.

In [150]:
# 방법 2.
df.drop(['John','Nate'], inplace=True)
df

       age        job
Jenny   30  Developer

#############################################

### 행(Row) Index로 행 데이터 Drop하기

In [146]:
# 데이터프레임을 리스트 데이터로 만들자
friend_dict_list = [
                    {'name':'John', 'age':20, 'job':'Student'},
                    {'name':'Jenny', 'age':30, 'job':'Developer'},
                    {'name':'Nate', 'age':30, 'job':'Teacher'}
                   ]

# 데이터프레임 생성
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [147]:
# 문제 : Row의 Index위치가 0과 2 위치인 행돌을 삭제해보자
df = df.drop(df.index[[0,2]])
df

    name  age        job
1  Jenny   30  Developer

In [152]:
# 데이터프레임을 리스트 데이터로 만들자
friend_dict_list = [
                    {'name':'John', 'age':20, 'job':'Student'},
                    {'name':'Jenny', 'age':30, 'job':'Developer'},
                    {'name':'Nate', 'age':30, 'job':'Teacher'}
                   ]

# 데이터프레임 생성
df = pd.DataFrame(friend_dict_list)


# 다음 예제를 위해서 바로 아래에 출력되는 데이터프레임을 살펴보자.
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [154]:
# 문제 : 위 데이터프레임의 데이터들 중에서 aga컬럼값이 30이 아닌 Row를 선택하여 
#       새로운 데이터프레임을 만들자
df[df.age != 30]

   name  age      job
0  John   20  Student

In [155]:
df

    name  age        job
0   John   20    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [156]:
# 문제 : age컬럼 세로 줄 삭제하기
df.drop('age', axis = 1)

    name        job
0   John    Student
1  Jenny  Developer
2   Nate    Teacher

#############################################

### [ 판다스 강의 7. ] 데이터프레임 행, 열 생성 및 수정하기

#### - 컬럼 추가 또는 변경하기

In [158]:
friend_dict_list = [
                    {'name':'John', 'age':15, 'job':'Student'},
                    {'name':'Jenny', 'age':30, 'job':'Developer'},
                    {'name':'Nate', 'age':30, 'job':'Teacher'}
                   ]

df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    Student
1  Jenny   30  Developer
2   Nate   30    Teacher

In [159]:
# 문제 : 새로운 salary컬럼을 기본값과 함께 추가해보자.
df['salary'] = 0 # salary컬럼의 기본값을 0으로 정의
df

    name  age        job  salary
0   John   15    Student       0
1  Jenny   30  Developer       0
2   Nate   30    Teacher       0

In [160]:
# 문제 : Numpy모듈(라이브러리)을 사용하여 한 줄에 새로운 컬럼값을 생성하여 수정 및 변경을 해보자.

# Numpy 모듈 불러오기
import numpy as np

In [161]:
# 데이터프레임의 job컬럼값이 student가 아니라면 salary컬럼의 값을 yes로 변경하고 
# student가 맞으면 no로 변경해보자
df['salary'] = np.where( df['job'] != 'Student', 'yes', 'no')
#                                 Student가 아니라면 yes, 맞다면 no
df

    name  age        job salary
0   John   15    Student     no
1  Jenny   30  Developer    yes
2   Nate   30    Teacher    yes

In [162]:
# 두 컬럼값을 더해서 새로운 컬럼을 만드는 예제를 위해 새로운 데이터프레임을 생성하자
# -> 학생 3명의 시험점수를 조작하여 migterm = 중간고사 점수, final = 기말고사 점수이다
friend_dict_list = [ 
                     {'name':'John', 'midterm':95, 'final':85},
                     {'name':'Jenny', 'midterm':85, 'final':80},
                     {'name':'Nate', 'midterm':10, 'final':30}
                   ]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [164]:
# 문제 : 기존에 있는 두 컬럼값을 더해서 새로운 컬럼을 만드는 예제이다.
#       중간고사 컬럼(midterm)과 기말고사 컬럼(final)을 더해서 새로운 총점 컬럼(total)을 만들어서 
#      새로운 총점 컬럼(total)을 만들어서 추가한 새로운 데이터 프레임을 만들자.
df['total'] = df['midterm'] + df['final']
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [165]:
# 문제 : 기존에 있는 중간고사 점수와 기말고사 점수의 총합(total)컬럼 값을 2로 나눈 평균값을 구하여 
#       새로운 평균(average)컬럼을 만들어서 값들을 저장한 예제이다.
df['average'] = df['total'] / 2
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [166]:
# 리스트에 조건별 값을 담아서 새로운 컬럼으로 추가시킬 수 있다.
# 문제 : 학생 평균 점수가 A,B,C,D,F학점인지 판별하여 새로운 등급(grade)컬럼을 추가시키는 예제이다.
grades = [] # 비어있는 리스트 저장

for row in df['average']: # [90, 82.5, 20.0]
    if row >= 90: # row변수의 값이 90점 이상이라면
        grades.append('A') # .append('추가할 데이터') 추가한다.
    elif row >= 80: # row변수의 값이 80점 이상이라면
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    elif row >= 60:
        grades.append('D')
    else:
        grades.append('F')
        
df['grade'] = grades # ['A', 'B', 'F'] 리스트에 값들을 저장한다.
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

In [167]:
# 문제 : grade컬럼 데이터들 A B F를 각각 PASS / FAIL로 나타내는 값들로 변경해보자
# 참고 : apply()를 사용한 예제이다.
#      - apply()를 사용하면 컬럼의 값을 변경하는 코드를 구현할 수 있다.
def pass_or_fail(row):
    print(row)
    if row != 'F':# 매개변수로 전달받은 row의 값이 F학점이 아니라면
        return 'PASS'
    else:
        return 'FAIL'
    
# 위에 출력된 데이터프레임의 grade컬럼의 값들을 변경하는데
# pass_or_fail함수를 호출하여 반환받는 값들로 변경시켜보자.
df.grade = df.grade.apply(pass_or_fail)
df

A
B
F

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  PASS
1  Jenny       85     80    165     82.5  PASS
2   Nate       10     30     40     20.0  FAIL

#############################################

### apply()를 사용하여 연, 월, 일의 정보에서 연도만 빼서 출력해보자.

In [168]:
date_list = [
              {'yyyy-mm-dd':'2000-06-27'},
              {'yyyy-mm-dd':'2002-09-24'}
            ]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24

In [170]:
# 참고 : split('분리할 구분자 기호') -> 문자열을 분리하는 함수

# 연도 정보만 분리하여 반환하는 함수 만들기
def extract_year(row): # 하나의 행(row)정보를 매개변수로 전달받는다 ex) 0 index 위치 -> 2000-06-27
    return row.split('-')[0] # [0]번째 인덱스 / 2000-06-27 연, 월, 일 중에서 -를 이용하여 분리한 문자열들을
                             # [2000. 06. 27] 중 0번째 인덱스 위치의 2000을 얻어서 반환한다.
   

# year라는 새로운 열을 추가하려 하는데 위 데이터프레임의 yyyy-mm-dd 컬럼 줄의 데이터만 들고와서 그 뒤에
# extract_year()를 호출하여 반환받은 연도 정보를 apply()를 이용하여 적용시켜보자.
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002

#############################################

### [ 판다스 강의 8. ] 데이터로 그룹 만들기 (Group by절)

#### - group by절 : 데이터에서 정보를 취하기 위해 그룹별로 묶는 방법에 대해서 알아보자.

In [171]:
# 학생 리스트 만들기
student_list = [
                 {'이름':'John', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Nate', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Abraham', '학과':'경영학과', '성별':'male'},
                 {'이름':'Brian', '학과':'경영학과', '성별':'male'},
                 {'이름':'Janny', '학과':'전기공학과', '성별':'female'},
                 {'이름':'Yuna', '학과':'전기공학과', '성별':'female'}
                ]

# 학생 리스트를 활용하여 데이터프레임 만들기
df = pd.DataFrame(student_list, columns=['이름', '학과', '성별'])
df

        이름      학과      성별
0     John  컴퓨터공학과    male
1     Nate  컴퓨터공학과    male
2  Abraham    경영학과    male
3    Brian    경영학과    male
4    Janny   전기공학과  female
5     Yuna   전기공학과  female

In [173]:
# 문제 : 중복된 학과를 그룹별로 묶어서 새로운 데이터프레임을 만들어보자.
groupby_major = df.groupby('학과')
groupby_major.groups
# 아래의 출력 결과
# - 경영학과 : 인덱스 2, 3위치의 학생이 2명 존재
# - 전기공학과 : 인덱스 4, 5위치의 학생이 2명 존재
# - 컴퓨터공학과 : 인덱스 0, 1위치의 학생이 2명 존재

{'경영학과': [2, 3], '전기공학과': [4, 5], '컴퓨터공학과': [0, 1]}

In [174]:
# 중복된 학과를 그룹별로 묶어서 새로 만든 데이터를 보기 좋게 만들어보자.
for name, group in groupby_major:
    print(name + ":" + str(len(group))) # str() : 문자열로 변환하는 함수
                                        # len() : 문자열의 길이를 나타내는 함수
    print(group)
    print()

경영학과:2
        이름    학과    성별
2  Abraham  경영학과  male
3    Brian  경영학과  male

전기공학과:2
      이름     학과      성별
4  Janny  전기공학과  female
5   Yuna  전기공학과  female

컴퓨터공학과:2
     이름      학과    성별
0  John  컴퓨터공학과  male
1  Nate  컴퓨터공학과  male

In [179]:
# 위 그룹 객체의 데이터를 보기 좋게 데이터프레임을 생성해보자
# 그룹 객체를 다시 데이터프레임으로 생성하는 예제이다.
# 각 학과 별로 몇명이 존재하는지 나타내기 위해 count컬럼을 추가시키고,
# 컬럼줄에 각 학과별로 몇명이 존재하는지 size()를 이용하여 얻는다.

df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index()
df_major_cnt

       학과  count
0    경영학과      2
1   전기공학과      2
2  컴퓨터공학과      2

#############################################

### [ 판다스 강의 9. ] 중복된 데이터 삭제하기 (drop duplicates)

In [181]:
# 학생 리스트 만들기
student_list = [
                 {'이름':'John', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Nate', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Abraham', '학과':'경영학과', '성별':'male'},
                 {'이름':'Brian', '학과':'경영학과', '성별':'male'},
                 {'이름':'Janny', '학과':'전기공학과', '성별':'female'},
                 {'이름':'John', '학과':'컴퓨터공학과', '성별':'male'}
               ]

# 학생 리스트를 활용하여 데이터프레임 만들기
df = pd.DataFrame(student_list, columns=['이름', '학과', '성별'])
df

        이름      학과      성별
0     John  컴퓨터공학과    male
1     Nate  컴퓨터공학과    male
2  Abraham    경영학과    male
3    Brian    경영학과    male
4    Janny   전기공학과  female
5     John  컴퓨터공학과    male

#### - duplicated()로 중복된 데이터 확인하기

In [182]:
df.duplicated() # 0번째 John의 행 데이터와 5번째 John 행 데이터가 중복되므로
                # 5 True => 중복되었다고 나타낸다.

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

#### - drop_duplicates()로 중복된 데이터를 삭제한다.

In [184]:
df = df.drop_duplicates() 
df # 중복된 5번째 데이터 값이 삭제되었다.

        이름      학과      성별
0     John  컴퓨터공학과    male
1     Nate  컴퓨터공학과    male
2  Abraham    경영학과    male
3    Brian    경영학과    male
4    Janny   전기공학과  female

In [185]:
# 다음 예제를 위해 아래와 같이 리스트 기반의 데이터프레임을 만들고 출력해보자.
# 학생 리스트 만들기
student_list = [
                 {'이름':'John', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Nate', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Abraham', '학과':'경영학과', '성별':'male'},
                 {'이름':'Brian', '학과':'경영학과', '성별':'male'},
                 {'이름':'Janny', '학과':'전기공학과', '성별':'female'},
                 {'이름':'John', '학과':'일어일문학과', '성별':'female'}
               ]

# 학생 리스트를 활용하여 데이터프레임 만들기
df = pd.DataFrame(student_list, columns=['이름', '학과', '성별'])
df

        이름      학과      성별
0     John  컴퓨터공학과    male
1     Nate  컴퓨터공학과    male
2  Abraham    경영학과    male
3    Brian    경영학과    male
4    Janny   전기공학과  female
5     John  일어일문학과  female

#### - 이름 컬럼의 값만 똑같을 경우 중복된 데이터라고 표시하는 예제이다.

In [186]:
df.duplicated(['이름'])

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

#### - keep속성의 값을 first 혹은 last라고 지정하여 중복된 값 중, 어느 값을 살릴지 결정할 수 있다. 기본값은 first이다.

In [187]:
# 이름 컬럼의 값이 똑같을 경우, 0번째 학생과 5번째 학생 중에서 5번째 학생은 살리고 0번째 학생의 행은 삭제한다.
df.drop_duplicates(['이름'], keep='last')

        이름      학과      성별
1     Nate  컴퓨터공학과    male
2  Abraham    경영학과    male
3    Brian    경영학과    male
4    Janny   전기공학과  female
5     John  일어일문학과  female

#############################################

### [ 판다스 강의 10. ] NaN(=None)을 찾아서 다른 값으로 변경하기. (fillna)

In [188]:
# 다음 예제를 위해 아래와 같이 리스트 기반의 데이터프레임을 만들고 출력해보자.
# 학생 리스트 만들기
student_list = [
                 {'이름':'John', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Nate', '학과':'컴퓨터공학과', '성별':'male'},
                 {'이름':'Abraham', '학과':'경영학과', '성별':'male'},
                 {'이름':'Brian', '학과':'경영학과', '성별':'male'},
                 {'이름':'Janny', '학과':'전기공학과', '성별':None},
                 {'이름':'John', '학과':'일어일문학과', '성별':None}
               ]

# 학생 리스트를 활용하여 데이터프레임 만들기
df = pd.DataFrame(student_list, columns=['이름', '학과', '성별'])
df

        이름      학과    성별
0     John  컴퓨터공학과  male
1     Nate  컴퓨터공학과  male
2  Abraham    경영학과  male
3    Brian    경영학과  male
4    Janny   전기공학과  None
5     John  일어일문학과  None

#### - Null 혹은 NaN 확인하기

In [189]:
# 위에 출력된 데이터프레임의 데이터들 중 NaN값이 들어있는지 확인하는 함수 1
df.info()  # info() : null값이 존재하는지 판별하는 함수 1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   학과      6 non-null      object
 2   성별      4 non-null      object
dtypes: object(3)
memory usage: 272.0+ bytes

In [190]:
# 위에 출력된 데이터프레임의 데이터들 중 NaN값이 들어있는지 확인하는 함수 2
df.isna() # isna() : null값이 존재하는지 판별하는 함수 2

      이름     학과     성별
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True

In [191]:
# 위에 출력된 데이터프레임의 데이터들 중 NaN값이 들어있는지 확인하는 함수 3
df.isnull()  # isnull() : null값이 존재하는지 판별하는 함수 3

      이름     학과     성별
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True

#### - NaN값을 임의의 값으로 설정하는 예제

In [199]:
df['성별'] = df['성별'].fillna(20)
df # 아래 출력문의 성별행에 있던 None값이 20으로 변경되었다.

        이름      학과    성별
0     John  컴퓨터공학과  male
1     Nate  컴퓨터공학과  male
2  Abraham    경영학과  male
3    Brian    경영학과  male
4    Janny   전기공학과    20
5     John  일어일문학과    20

### [ 판다스 강의 11. ] unique(), value_counts() -> 컬럼 내부에 존재하는 값을 중복없이 뽑아내고 갯수를 확인한다.

In [200]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [202]:
# unique() : 컬럼 내부에 존재하는 값을 중복없이 뽑아낸다.
# - 컬럼(Series)의 unique()를 호출하면 중복없이 컬럼에 있는 모든 값들을 출력할 수 있다.
print(df.job.unique()) # print()를 사용할 경우, 리스트 형태로 출력한다.

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

In [203]:
# value_counts() : 유니크한 값 별로 몇 개의 데이터가 속하는지 확인할 수 있다.
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
dentist              1
basketball player    1
developer            1
Name: job, dtype: int64